[
    "Badal Chauhan\n§ Badal-2 | (cid:239) badalchauhanbca | (cid:128) bol7.com | # badalbusiness02@gmail.com | H 8076282134\nSummary\nMotivated Python and AI Developer with hands-on experience in building backend systems, AI-powered\nchatbots,andclouddeployments. SkilledinDjango,LangChain,PostgreSQL,andGeminiAPI.Passionate\nabout crafting efficient solutions through RAG-based architectures and modern web frameworks. Seeking\nopportunities to grow as a backend and AI developer while contributing to impactful, real-world projects.\nFor more details, visit my GitHub.\nWork Experience\nMachine Learning Intern — Unified Mentor Pvt. Ltd., Gurugram Nov 2024 - Mar 2025\n• Contributed to designing and implementing machine learning models across various projects.\n• Collected and preprocessed data to prepare for model training.\n• Conducted testing and performance evaluation for machine learning models.\n• Created visualizations using Matplotlib and Seaborn to interpret data patterns.\nPython & AI Developer — BOL7 Technologies, Noida Aug 2025 - Oct 2025\n– Developed RAGMentor, a retrieval-augmented generation system integrating large language mod-\nels (LLMs) and vector databases for advanced document-based QA.\n– Built Gemini & GPT chatbots with persistent memory using embeddings.\n– Engineered voice-based calling bot capable of understanding user commands and giving responses.\n– Implemented WebRTC + WebSocket connections for real-time communication.\n– Integrated PostgreSQL with Django and deployed multiple AI & web projects.\n– Applied LangChain, Faiss, HuggingFace, and RAG techniques to improve system efficiency.\n– Developed frontend UI with HTML, CSS, JS & Tailwind for multi-page projects.\n– Ensured secure authentication using OAuth 2.0, Authlib, and session middleware.\n– ConvertedtextintovectorembeddingsusingGemini mbedding 01modelforotherlanguages,storedtheminPostgreSQL,andappliedRAGforretrievingthemostsimilarvectorsbasedonuserqueries.\nE 0\nProjects\nWebRTC + WebSocket Integration GitHub\nDeveloped a real-time communication system using WebRTC and WebSocket for seamless audio/video\nstreamingandinteractiveconnectivity. Later,integratedWebhookAPIstoenablelivecallingfunctionality\nfrom a voice bot, ensuring smooth, real-time interactions and automated responses.\nText-to-Vector Embedding System GitHub\nConverted text paragraphs into embedding vectors using Gemini Embedding API and custom embedding\npipelines for AI-driven applications.\nFrontend Development (31 Pages) GitHub\nDesigned and implemented a 31-page responsive frontend using HTML, CSS, JavaScript, and Tailwind\nCSS. Integrated UI with backend systems for full functionality.\nBOL7 Chat Support Bot GitHub\nDeveloped an AI-driven WhatsApp chat support bot for BOL7 Technologies, allowing users to ask\ncompany-related queries through both text and voice. Integrated speech recognition with Gemini API\nand RAG-based architecture for accurate, context-aware responses.",
    "Education\n2023 - Present Bachelor of Computer Application (BCA), Chaudhary Charan Singh University\n(CCSU), India 5th Semester\n2022 Class 12th, Commerce Passed\n2020 Class 10th, [GBSS School] Passed\n———————————————————–\nSkills\n• Languages C, Python\n• Databases PostgreSQL, MySQL, MongoDB\n• Libraries Tkinter, TensorFlow, NumPy, Pandas, Faiss, pgvector,\nHugging Face Transformers, LangRAG, GPT-based APIs, LLM, PyTorch\n• CS Concepts OOP, DSA, Operating Systems, DBMS, Functions,\n• Web Technologies HTML, CSS, JavaScript, Tailwind\n• Frameworks / Tools Django, Django REST Framework, Flask, LangChain,\nLangGraph, REST APIs\n• Soft Skills Problem-solving, Communication, Adaptability\nCertifications\n– Python Full Stack Developer - Ducat School (View Certificate)\nLast updated: October 8, 2025"
]